src/cf/InformationRegisters/КалькуляцияРасходовВСчетеНаОплатуПокупателю.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>КалькуляцияРасходовВСчетеНаОплатуПокупателю</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоНаЕдиницу</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СчетНаОплатуПокупателю</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
						<v8:Type>cfg:DocumentRef.КоммерческоеПредложение</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючКалькуляцииРасходов</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерСтрокиКалькуляции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/CommonModules/КалькуляцииРасходовКлиент/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

Процедура ОткрытьКалькуляциюРасходов(Форма, ВыбраннаяСтрока, АдресСРасчетамиКалькуляции, Знач ДатаДокумента = Неопределено, ТолькоНаПросмотр = Неопределено) Экспорт
	
	Объект = Форма.Объект;
	
	Если ДатаДокумента = Неопределено Тогда
		ДатаДокумента = Объект.Дата;
	КонецЕсли;
	
	Склад = Неопределено;
	Объект.Свойство("Склад", Склад);
	
	ПодразделениеОрганизации = Неопределено;
	Объект.Свойство("ПодразделениеОрганизации", ПодразделениеОрганизации);
	
	ПараметрыЗакрытияФормы = Новый Структура;
	ПараметрыЗакрытияФормы.Вставить("ВыбраннаяСтрока",          ВыбраннаяСтрока);
	ПараметрыЗакрытияФормы.Вставить("КлючКалькуляцииРасходов",  ВыбраннаяСтрока.КлючКалькуляцииРасходов);
	ПараметрыЗакрытияФормы.Вставить("АдресВременногоХранилища", АдресСРасчетамиКалькуляции);
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ПерезаполнитьКалькуляциюРасходов",
		Форма, ПараметрыЗакрытияФормы);
	
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("Продукция",                ВыбраннаяСтрока.Номенклатура);
	ПараметрыОткрытияФормы.Вставить("КоличествоПродукции",      ВыбраннаяСтрока.Количество);
	ПараметрыОткрытияФормы.Вставить("ЦенаПродукции",            ВыбраннаяСтрока.Цена);
	ПараметрыОткрытияФормы.Вставить("Организация",              Объект.Организация);
	ПараметрыОткрытияФормы.Вставить("Склад",                    Склад);
	ПараметрыОткрытияФормы.Вставить("ПодразделениеОрганизации", ПодразделениеОрганизации);
	ПараметрыОткрытияФормы.Вставить("ДатаДокумента",            ДатаДокумента);
	ПараметрыОткрытияФормы.Вставить("КлючКалькуляцииРасходов",  ВыбраннаяСтрока.КлючКалькуляцииРасходов);
	ПараметрыОткрытияФормы.Вставить("СчетНаОплатуПокупателю",   Объект.Ссылка);
	ПараметрыОткрытияФормы.Вставить("АдресВременногоХранилища", АдресСРасчетамиКалькуляции);
	ПараметрыОткрытияФормы.Вставить("ЗаполнитьПоСпецификации",  Не ЗначениеЗаполнено(ВыбраннаяСтрока.КлючКалькуляцииРасходов));
	ПараметрыОткрытияФормы.Вставить("ТолькоПросмотр",           Форма.ТолькоПросмотр Или ТолькоНаПросмотр = Истина);
	
	ОткрытьФорму("РегистрСведений.КалькуляцияРасходовВСчетеНаОплатуПокупателю.Форма.ФормаКалькуляцияРасходов",
		ПараметрыОткрытияФормы, , , , , ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти
